perf/output_light.log

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/

     execution: local
        script: /load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m20s max duration (incl. graceful stop):
              * default: Up to 10 looping VUs for 50s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/10 VUs, 8 complete and 0 interrupted iterations
default   [   2% ] 01/10 VUs  01.0s/50.0s

running (0m02.0s), 02/10 VUs, 26 complete and 0 interrupted iterations
default   [   4% ] 02/10 VUs  02.0s/50.0s

running (0m03.0s), 03/10 VUs, 51 complete and 0 interrupted iterations
default   [   6% ] 03/10 VUs  03.0s/50.0s

running (0m04.0s), 04/10 VUs, 84 complete and 0 interrupted iterations
default   [   8% ] 04/10 VUs  04.0s/50.0s

running (0m05.0s), 05/10 VUs, 125 complete and 0 interrupted iterations
default   [  10% ] 05/10 VUs  05.0s/50.0s

running (0m06.0s), 06/10 VUs, 174 complete and 0 interrupted iterations
default   [  12% ] 06/10 VUs  06.0s/50.0s

running (0m07.0s), 07/10 VUs, 234 complete and 0 interrupted iterations
default   [  14% ] 07/10 VUs  07.0s/50.0s

running (0m08.0s), 08/10 VUs, 301 complete and 0 interrupted iterations
default   [  16% ] 08/10 VUs  08.0s/50.0s

running (0m09.0s), 09/10 VUs, 374 complete and 0 interrupted iterations
default   [  18% ] 09/10 VUs  09.0s/50.0s

running (0m10.0s), 09/10 VUs, 456 complete and 0 interrupted iterations
default   [  20% ] 09/10 VUs  10.0s/50.0s

running (0m11.0s), 10/10 VUs, 553 complete and 0 interrupted iterations
default   [  22% ] 10/10 VUs  11.0s/50.0s

running (0m12.0s), 10/10 VUs, 643 complete and 0 interrupted iterations
default   [  24% ] 10/10 VUs  12.0s/50.0s

running (0m13.0s), 10/10 VUs, 735 complete and 0 interrupted iterations
default   [  26% ] 10/10 VUs  13.0s/50.0s

running (0m14.0s), 10/10 VUs, 833 complete and 0 interrupted iterations
default   [  28% ] 10/10 VUs  14.0s/50.0s

running (0m15.0s), 10/10 VUs, 923 complete and 0 interrupted iterations
default   [  30% ] 10/10 VUs  15.0s/50.0s

running (0m16.0s), 10/10 VUs, 1015 complete and 0 interrupted iterations
default   [  32% ] 10/10 VUs  16.0s/50.0s

running (0m17.0s), 10/10 VUs, 1105 complete and 0 interrupted iterations
default   [  34% ] 10/10 VUs  17.0s/50.0s

running (0m18.0s), 10/10 VUs, 1203 complete and 0 interrupted iterations
default   [  36% ] 10/10 VUs  18.0s/50.0s

running (0m19.0s), 10/10 VUs, 1295 complete and 0 interrupted iterations
default   [  38% ] 10/10 VUs  19.0s/50.0s

running (0m20.0s), 10/10 VUs, 1385 complete and 0 interrupted iterations
default   [  40% ] 10/10 VUs  20.0s/50.0s

running (0m21.0s), 10/10 VUs, 1475 complete and 0 interrupted iterations
default   [  42% ] 10/10 VUs  21.0s/50.0s

running (0m22.0s), 10/10 VUs, 1565 complete and 0 interrupted iterations
default   [  44% ] 10/10 VUs  22.0s/50.0s

running (0m23.0s), 10/10 VUs, 1665 complete and 0 interrupted iterations
default   [  46% ] 10/10 VUs  23.0s/50.0s

running (0m24.0s), 10/10 VUs, 1755 complete and 0 interrupted iterations
default   [  48% ] 10/10 VUs  24.0s/50.0s

running (0m25.0s), 10/10 VUs, 1845 complete and 0 interrupted iterations
default   [  50% ] 10/10 VUs  25.0s/50.0s

running (0m26.0s), 10/10 VUs, 1935 complete and 0 interrupted iterations
default   [  52% ] 10/10 VUs  26.0s/50.0s

running (0m27.0s), 10/10 VUs, 2025 complete and 0 interrupted iterations
default   [  54% ] 10/10 VUs  27.0s/50.0s

running (0m28.0s), 10/10 VUs, 2125 complete and 0 interrupted iterations
default   [  56% ] 10/10 VUs  28.0s/50.0s

running (0m29.0s), 10/10 VUs, 2215 complete and 0 interrupted iterations
default   [  58% ] 10/10 VUs  29.0s/50.0s

running (0m30.0s), 10/10 VUs, 2305 complete and 0 interrupted iterations
default   [  60% ] 10/10 VUs  30.0s/50.0s

running (0m31.0s), 10/10 VUs, 2395 complete and 0 interrupted iterations
default   [  62% ] 10/10 VUs  31.0s/50.0s

running (0m32.0s), 10/10 VUs, 2485 complete and 0 interrupted iterations
default   [  64% ] 10/10 VUs  32.0s/50.0s

running (0m33.0s), 10/10 VUs, 2585 complete and 0 interrupted iterations
default   [  66% ] 10/10 VUs  33.0s/50.0s

running (0m34.0s), 10/10 VUs, 2675 complete and 0 interrupted iterations
default   [  68% ] 10/10 VUs  34.0s/50.0s

running (0m35.0s), 10/10 VUs, 2765 complete and 0 interrupted iterations
default   [  70% ] 10/10 VUs  35.0s/50.0s

running (0m36.0s), 10/10 VUs, 2855 complete and 0 interrupted iterations
default   [  72% ] 10/10 VUs  36.0s/50.0s

running (0m37.0s), 10/10 VUs, 2945 complete and 0 interrupted iterations
default   [  74% ] 10/10 VUs  37.0s/50.0s

running (0m38.0s), 10/10 VUs, 3045 complete and 0 interrupted iterations
default   [  76% ] 10/10 VUs  38.0s/50.0s

running (0m39.0s), 10/10 VUs, 3135 complete and 0 interrupted iterations
default   [  78% ] 10/10 VUs  39.0s/50.0s

running (0m40.0s), 10/10 VUs, 3225 complete and 0 interrupted iterations
default   [  80% ] 10/10 VUs  40.0s/50.0s

running (0m41.0s), 10/10 VUs, 3315 complete and 0 interrupted iterations
default   [  82% ] 10/10 VUs  41.0s/50.0s

running (0m42.0s), 09/10 VUs, 3406 complete and 0 interrupted iterations
default   [  84% ] 09/10 VUs  42.0s/50.0s

running (0m43.0s), 08/10 VUs, 3479 complete and 0 interrupted iterations
default   [  86% ] 08/10 VUs  43.0s/50.0s

running (0m44.0s), 07/10 VUs, 3543 complete and 0 interrupted iterations
default   [  88% ] 07/10 VUs  44.0s/50.0s

running (0m45.0s), 06/10 VUs, 3598 complete and 0 interrupted iterations
default   [  90% ] 06/10 VUs  45.0s/50.0s

running (0m46.0s), 05/10 VUs, 3649 complete and 0 interrupted iterations
default   [  92% ] 05/10 VUs  46.0s/50.0s

running (0m47.0s), 04/10 VUs, 3686 complete and 0 interrupted iterations
default   [  94% ] 04/10 VUs  47.0s/50.0s

running (0m48.0s), 03/10 VUs, 3714 complete and 0 interrupted iterations
default   [  96% ] 03/10 VUs  48.0s/50.0s

running (0m49.0s), 02/10 VUs, 3735 complete and 0 interrupted iterations
default   [  98% ] 02/10 VUs  49.0s/50.0s

running (0m50.0s), 01/10 VUs, 3745 complete and 0 interrupted iterations
default   [ 100% ] 01/10 VUs  50.0s/50.0s

     ✓ status is 200

     checks.........................: 100.00% 3746 out of 3746
     data_received..................: 765 kB  15 kB/s
     data_sent......................: 315 kB  6.3 kB/s
     http_req_blocked...............: avg=9.05µs   min=1.32µs   med=5.31µs   max=672.25µs p(90)=8.88µs  p(95)=13.06µs
     http_req_connecting............: avg=2.03µs   min=0s       med=0s       max=316µs    p(90)=0s      p(95)=0s
     http_req_duration..............: avg=7.4ms    min=3.72ms   med=7.22ms   max=26.15ms  p(90)=8.99ms  p(95)=9.46ms
       { expected_response:true }...: avg=7.4ms    min=3.72ms   med=7.22ms   max=26.15ms  p(90)=8.99ms  p(95)=9.46ms
     http_req_failed................: 0.00%   0 out of 3746
     http_req_receiving.............: avg=49.44µs  min=8.33µs   med=45.7µs   max=556.42µs p(90)=73.82µs p(95)=83.93µs
     http_req_sending...............: avg=17.4µs   min=3.17µs   med=14.45µs  max=607.52µs p(90)=25.12µs p(95)=31.39µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s      p(95)=0s
     http_req_waiting...............: avg=7.34ms   min=3.67ms   med=7.15ms   max=25.95ms  p(90)=8.89ms  p(95)=9.38ms
     http_reqs......................: 3746    74.830661/s
     iteration_duration.............: avg=108.23ms min=104.82ms med=108.02ms max=127.06ms p(90)=109.9ms p(95)=110.33ms
     iterations.....................: 3746    74.830661/s
     vus............................: 1       min=1            max=10
     vus_max........................: 10      min=10           max=10


running (0m50.1s), 00/10 VUs, 3746 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  50s